/**
 * Created by douson on 13.07.15.
 */

var ru;

ru = {
  
  //Global
  ADD: 'Добавить',
  APP_NAME: 'Светлячки',
  CONTENT_READ_MORE_TITLE: 'Подробнее',
  CONTACT_US:'Свяжитесь с нами',
  SEND_MESSAGE: 'Написать сообщение',
  YES: 'Да',
  NO: 'Нет',
  ACTIVE:'Активные',
  ACTIVE_HINT:'Посты, находящиеся в активном режиме. Их видят другие пользователи',
  LIVE:'Живые',
  LIVE_HINT:'Посты с динамической локацией, привязаны к мобильному устройству',
  ALL:'Все',
  ALL_HINT:'Все созданные вами посты',
  COMMENTS:'Комментарии',
  RATING: 'Рейтинг',
  REVIEW_HELP_TEXT: 'Оставьте свой комментарий здесь',
  CHOOSE_RATING: 'Выберите рейтинг',
  SUBMIT: 'Отправить',
  SEND:'Отправить',
  CANCEL: 'Отмена',
  OR:'ИЛИ',
  READ_MORE:'Подробнее',
  NEW_POST: 'Новый пост',
  CREATE_POST: 'Создать пост',
  CHECK_ALL: 'Выбрать все',
  TODAY:'сегодня',
  DAYS:'дней',
  searchLocationText:'Название места или адрес',

  BZ_RESULTS_FOUND: 'Найдено результатов',
  BZ_DISTANCE: 'Дистанция',
  BZ_IS_PHOTO: 'Есть фото',
  BZ_SETTINGS_CATEGORY: 'Настройки категории',
  BZ_ALL_CATEGORIES_JOBS: 'Показать все',
  BZ_LOOKING_FOR_JOBS: 'Посты с поиском работы',
  BZ_JOBS_OFFERED: 'Посты с предложениями работы',
  BZ_EMPLOYMENT_AND_WORK_SCHEDULE: 'Работа и график работы',
  BZ_EMPLOYMENT_AND_WORK_SCHEDULE_DESC: 'Работа и график работы',
  BZ_FULL_DAY: 'Полная занятость',
  BZ_PROJECT:'Проектная/Временная работа',
  BZ_PART_TIME: 'Частичная занятость',
  BZ_VOLUNTEER:'Волонтерство',
  BZ_WORK_PROBATION: 'Стажировка',
  BZ_BY_PROFESSION: 'По профессии',
  BZ_WITHOUT_EXPERIENCE: 'Без опыта',
  BZ_FREELANCE: 'Фрилансер',
  BZ_CHOOSE_TYPE_TRAININGS: 'Выбрать тип тренинга',
  BZ_CHOOSE_TYPE_TRAININGS_DESC: 'Выбрать тип тренинга',
  BZ_ACTION_DONE: 'Применить',

  BZ_DURATION_START_SELECTED: 'На выбор ...',
  BZ_DURATION_CLICK_TO_CH_DATE: 'Нажмите, чтобы выбрать дату',
  DATE_TOMORROW: 'Завтра',


  //No posts around
  NO_ITEMS_AROUND_YOU: 'Рядом с вами пока нет постов',
  NO_ITEMS_AROUND_LOCATION_NOT_DEFINED: 'Не удалось определить местоположение',
  YOU_CAN_CREATE_POST: 'Создайте свое объявление, чтобы о вашем запросе узнали другие пользователи и могли с вами связаться!',
  TRY_TO_SET_LOCATION: 'Задать местоположение самостоятельно',
  TRY_TO_RESET_SEARCH: 'Сбросить поисковые фильтры',
  //Buttons
  BUTTON_CHECK: 'Проверить',
  BUTTONS_BACK: 'Назад',
  BUTTON_SHOW_MORE_POSTS: 'Показать еще посты',

  //Menu
  MENU_HOME_PAGE: 'Главная',
  MENU_ABOUT_US: 'О нас',
  MENU_CONTACTS: 'Контакты',
  MENU_OR_SPLIT: 'или',
  MENU_MAP: 'Карта',
  MENU_MAIN_PAGES_TITLE: 'Основные страницы',
  MENU_HASHES_TITLE: 'Хэштеги',
  MENU_MY_POSTS: 'Мои Посты',
  MENU_MY_PROFILE: 'Профайл',
  MENU_MY_MESSAGES: 'Сообщения',
  MENU_BUTTON_NEW_POST: 'Создать',
  MENU_SIGN_IN: 'Вход',
  MENU_SIGN_OUT: 'Выход',
  MENU_SIGN_UP: 'Регистрация',
  MENU_SIGNED_IN_AS: 'Вы вошли как ',
  MENU_CHANGE_LANGUAGE: 'Выберите язык',

  getAllUsers:         'Все пользователи системы',
  getContactUsers:     'Найденные контакты',
  status:              'Статус',
  active:              'Активные',
  inactive:            'Завершенные',
  SEEN_TODAY: 'Сегодня',
  SEEN_ALL: 'Всего',
  SEEN_TOTAL: 'Итого',
  left:                'Осталось',
  POST_STATUS: 'Объявление закрыто',

  POST_SWITCH_OFF_ON: 'Снять с показа. Снятые с публикации объявления не показываются другим пользователям.',
  POST_SWITCH_OFF_OFF: 'Вернуть к показу. Объявление будет снова опубликовано на сайте.',
  
  headliner:           'Вокруг тебя',
  siteTitleElement: 'instant post, bound to location',

  SEARCH_DISTANCE_TITLE: 'Расстояние',
  SEARCH_DISTANCE_MILE: '1 миля',
  SEARCH_DISTANCE_MILES_5: '5 миль',
  SEARCH_DISTANCE_MILES_20: '20 миль',
  SEARCH_DISTANCE_FT_200: '200 футов',
  SEARCH_DISTANCE_EVERYWHERE: 'Везде',
  SEARCH_LOOKING_FOR_TEXT: 'Искать ЧТО, ГДЕ, КОГДА',

  MOST_POPULAR_TITLE: 'Самые популярные',
  ABOUT_US_TITLE: 'О нас',

  AROUND_YOU_TITLE: 'Срочное рядом',

  //Location
  LOCATION_SET_YOUR_LOCATION: 'Настройка метоположения',
  LOCATION_YOUR_MOST_RECENT_LOCATIONS: 'Ваши последние места: ',
  LOCATION_BUTTON_SET_LOCATION: 'Установить',
  LOCATION_MY_CURRENT_LOCATION: 'Определить текущее местоположение',
  LOCATION_MY_COMPUTATION_LOCATION: 'Определенный адрес: ',
  LOCATION_CLICK_TO_CHOSE_LOCATION:'Нажмите чтобы выбрать место',
  MY_LOCATION_TEXT: 'Мое Положение',
  LOCATION_IS_NOT_DEFINED: 'Местоположение не определено',

  //Profile
  PROFILE_USER_DETAILS :'Профиль пользователя',
  PROFILE_PERSONAL_SETTINGS :'Личные настройки',
  PROFILE_EDIT_PROFILE: 'Редактировать',
  PROFILE_ADDITIONAL_LINKS: 'Внешние ссылки',
  PROFILE_FACEBOOK_URL: 'Facebook',
  PROFILE_USER_LANGUAGE: 'Язык',
  PROFILE_USER_PHONE: 'Телефон',
  PROFILE_USER_SKYPE: 'Skype',
  PROFILE_USER_STATUS: 'Статус',
  PROFILE_PROFILE_URL: 'URL профиля',
  PROFILE_USER_DETAILS_POSTS: 'Публикации',
  PROFILE_USER_VK: 'Вконтакте',
  PROFILE_USER_FACEBOOK: 'Facebook',
  PROFILE_USER_TWITTER: 'Twitter',
  PROFILE_USER_TOWN: 'Город',
  PROFILE_CANCEL: 'Отмена',

  //Another user profile details
  PROFILE_ANOTHER_USER_DETAILS_PERSONAL_DATA: 'Личные данные',
  PROFILE_DIRECT_LINK_TO_MY_PROFILE: 'Прямая ссылка на мой профиль',
  PROFILE_MAKE_MY_PUBLICATION_AVAILABLE_TO_ALL_USERS: 'Сделать мои публикации доступными для всех пользователей', 


  //Profile - edit
  PROFILE_EDIT_USER_AVATAR: 'Настройки аватара',
  PROFILE_EDIT_PERSONAL_SETTINGS: 'Редактирование личных настроек',
  PROFILE_SAVE_AND_UPDATE: 'Сохранить',
  PROFILE_USERNAME: 'Имя пользователя',
  PROFILE_USER_FIRST_NAME: 'Имя',
  PROFILE_USER_LAST_NAME: 'Фамилия',
  PROFILE_USER_PHONE_NUMBER: 'Номер телефона',
  PROFILE_USER_SKYPE_LOGIN : 'Логин Skype',
  PROFILE_USER_SECURITY_SETTINGS : 'Настройки безопасности',
  PROFILE_POLICY_PUBLIC:'Публично',
  PROFILE_POLICY_HIDDEN:'Скрыто',

  //Image select
  IMAGE_SELECT_UPLOAD_PHOTO: 'Загрузить фото',
  IMAGE_SELECT_IMAGE_FROM_URL: 'Указать URL картинки',
  IMAGE_SELECT_RANDOM_IMAGE: 'Случайное изображение',
  IMAGE_SELECT_MY_IMAGES: 'Мои картинки',
  IMAGE_SELECT_TAKE_PHOTO:'Сделать фото',
  IMAGE_SELECT_IMAGE_URL:'URL изображения',
  IMAGE_SELECT_CHECK_IMAGE:'Проверить картинку',
  IMAGE_SELECT_PASTE_FROM_CLIPBOARD:'Вставить из буфера обмена',
  IMAGE_SELECT_DONE: 'Добавить',
  IMAGE_SELECT_UPLOAD_NEW_PROFILE_IMAGE: 'Загрузить новый профиль изображения',
  IMAGE_SELECT_CHOOSE_IMAGE: 'Выбрать картинку',
  IMAGE_PHOTO_LIBRARY_IS_NOT_AVAILABLE:'Фото библиотека недоступна.',
  IMAGE_PHOTO_INDEX_NOT_FOUND: 'Индекс фотографии не найден.',

  //chats
  CHATS_LAST_MESSAGE: 'Последнее сообщение',
  CHATS_NO_CONVERSATIONS: 'У вас нет разговоров пока',
  CHATS_START_MESSAGING:'Вы можете начать обмен сообщениями, нажав на кнопку карандаша в правом верхнем углу или нажмите кнопку ниже.',
  CHATS_GO_CONTACTS:'перейти в контакты',
  CHATS_SEARCH: 'Поиск по сообщениям или пользователям',
  CHATS_FILTER:'Фильтр',
  CHATS_NEW_CHAT_MESSAGE: 'Новое сообщение',
  CHATS_SUMMARY: 'Диалогов',
  CHATS_TYPE_YOUR_MESSAGE: 'Текст сообщения ...',

  //Error
  ERROR_INVALID_FIELD: 'Это поле обязательно для заполнения',
  ERROR_INVALID_INTEGER_PATTERN: 'Это поле обязательно и только цифры',

  COMMON_IMAGE_GET_RANDOM: 'Загрузить случайное фото',

  //Sign In and Sign Up
  SIGN_IN:'Войдите в систему',
  TO_SEE_YOUR_PLACES_HISTORY:'для того чтобы увидеть ваши последние места.',
  PLEASE_SIGN_IN:'Пожалуйста',
  confirmPassword:'Подтвердите пароль',
  SIGN_VALID_USERNAME:'Введите корректное имя пользователя',
  SIGN_VALID_EMAIL: 'Введите корректный адрес почты',
  SIGN_VALID_PASSWORD:'Ваш пароль должен соответствовать требованиям',
  SIGN_VALID_USERNAME_OR_EMAIL:'Введите корректное имя пользователя или адрес почты',
  
  
  
  /*PAGE ABOUT US*/
  HEADER: {
    'TITLE': 'Единственный сервис, предлагающий живое присутсвие!',
    'PARAG_1': 'Светлячки позволяют привязать объявление или любой адрес в интернете к текущему местоположению пользователя, и, как результат, осуществлять мгновенный поиск информации среди людей вокруг. Это позволяет искать информацию здесь и сейчас с целью мгновенной встречи с ее владельцем. Ненужное промежуточное звено (поиск по интернету, договор о встрече, дорогу к месту) можно исключить, если потенциально интересующий нас человек находится поблизости.',
    'PARAG_2': 'Мы расширяем возможности Веба, посредством привязки информации к реальным людям и координатам, что дает веб-ресурсам новое,- пространство-временное, качество, то есть путь напрямик к цели! Нас также видно в Google и соцсетях, и поэтому твое объявление превращается в собственную интернет-страницу, которую при желании увидит весь интернет.',
    'PARAG_3': 'Представь себе виртуальную визитку, только носишь ты ее не в кошельке, а в мобильном телефоне, и видят ее не избранные, а все, кто рядом!',

    // 'PARAG_4': 'Мы познакомим тебя с людьми, местами и событиями вокруг! И не просто познакомим, а поможем использовать возможости интернета для живых встреч!'
  },
  HOW_DOES_IT_WORK: {
    'TITLE': 'Как это работает?',
    'PARAG_1': 'Представь себе виртуальную визитку, только носишь ты ее не в кошельке, а в мобильном телефоне, и видят ее не избранные, а все, кто рядом!',
    'CREATE_POST':'Создай свой пост',
    'YOU_FIND':'Ты находишь - Тебя находят',
    'MEETING':'Договаривайся - встречайся'
  },
  WHY_WE_ARE_HELPFUL: {
    'TITLE': 'Чем мы полезны?',
    'PARAG_1':'Один сервис для всех ресурсов - светлячки дают возможность привязать любой пост, размещенный на любом интернет-ресурсе к текущему местоположению пользователя.',
    'TYPES_OF_POSTS_ACCORDING':'Типы постов по содержанию',
    'ADVERTISEMENT':'Объявление',
    'ADVERTISEMENT_T1':'Полноценная страница в интеренете.',
    'ADVERTISEMENT_CONTENT':'Введи данные, необходимые для полноценного объявления и получи страницу в интернете поста, привязанную к месту и твоей "доступности".',
    'LINK':'Ссылка',
    'LINK_T1':'Быстрое создание поста одним нажатием!',
    'LINK_CONTENT':'Если у тебя уже есть адрес в интернете, дающий всю необходимую информацию - просто используй эту ссылку и получи готовый Светлячок! Это удобно - не тратить время на создание объявления. Несколько кликов и вся важная информация будет освещаться Светлячками!',
    'TYPES_OF_POSTS_LOCATION':'Типы локаций постов',
    'DYNAMIC':'Динамический пост',
    'DYNAMIC_T1':'Движется вместе с тобой.',
    'DYNAMIC_CONTENT':'Носи его в своем кармане - установи светлячок один раз и он будет перемещаться вместе с тобой, показывая твое объявление людям вокруг. Используй Светлячок как повод для знакомства и реально встречи. Светлячок будет "включен" всегда!',
    'STATIC':'Статический пост',
    'STATIC_T1':'Привязан к заданной тобой местности.',
    'STATIC_CONTENT':'Если ты хочешь, чтобы Светлячок указывал на твою мастерскую, офис или кабинет, и ты больше времени проводишь там, чем в движении - создай Статический пост. Светлячок "включится" автоматически, когда ты будешь рядом и отключится, если ты покинул его!'
  },
  WHO_ARE_WE: {
    'TITLE':'Кто мы',
    'PARAG_1':'Мы - небольшой стартап, верящий в идею важности реальных встреч и необходимости единого поискового сервиса'
  },
  SAFETY: {
    'TITLE':'Безопасность',
    'PARAG_1':'Вы размещаете у нас только ту информацию, которую считаете нужной. Рассылок, навязчивых предложений у нас нет!'
  },
  RULES: {
    'TITLE':'Правила',
    'PARAG_1':'При регистрации на «Cветлячках» Пользователь соглашается с настоящими правилами и принимает на себя'
  },
  'CONTACT_WITH_US': {
    'TITLE':'Связаться с нами',
    'PARAG_1':'Если вы чего-то не нашли на сайте, или у вас есть предложение и отзывы, пишите нам. С удовольствием ответим каждому!'
  },
  FAQ: {
    'TITLE':'Частые вопросы',
    'PANEL1_Q':'Как работают светлячки?',
    'PANEL1_A':'Светлячки - это поисковая система по живым объявлениям от реальных людей вокруг.\n С помощью светлячков ты также можешь создавать свои живые объявления, которые будут перемещаться с тобой и будут доступны людям поблизости.',

    'PANEL2_Q':'Как искать информацию?',
    'PANEL2_A':'Достаточно открыть приложение или сайт и увидеть тех, кто рядом и что они предлагают, либо искать по ключевым словам в \"умной строке\". Также, можно воспользоваться поиском по категориям и тэгам. В каждом разделе можно увидеть Светлячков, которые сейчас рядом, и другие популярные посты по каждой теме.',

    'PANEL3_Q':'Что делать на сайте?',
    'PANEL3_A':'1. Cоздай свой пост - размести свое объявление или размести ссылку на пост на другом ресурсе — и ты получишь готовый светлячок. 2. Теперь твое объявление всегда с тобой в твоем кармане. Он будет перемещаться вместе с тобой, показывая людям вокруг твое объявление. 3. Cмотри живые объявления от людей по близости — найди то, что тебе интересно и важно. 4. Знакомься — общайся-встречайся.',

    'PANEL4_Q':'Зачем устанавливать светлячок?',
    'PANEL4_A':'Светлячок прикрепляет любое ваше объявление к вашему местоположению. После этого ваше объявление будет связано с вами, будет перемещаться с вами и его могут увидеть люди, которые находятся поблизости.',

    'PANEL5_Q':'Какой пост создать?',
    'PANEL5_A':'Вы можете разместить любое объявление - т.е. указать причину, по который ты бы хотел встретиться незамедлительно - и о твоем намерении незамедлительно узнают люди вокруг. Это может быть частное объявление, реклама услуги, ссылка на страничку или пост в ВК. Продаешь ли ты платье или ищешь работу, предлагаешь курсы по йоге или ищешь компанию для вечеринки - расскажи об этом, и Светлячки помогут тебе найти единомышленников, покупателей, собеседников рядом.',

    'PANEL6_Q':'Чем отличается динамический пост от статического?',
    'PANEL6_A':'Динамический пост привязан к вам и перемещается вместе с вами, его видят люди, которые находятся рядом с вами, куда бы вы не переместились.  Статический пост привязан к определенному адресу, он активный в тот момент, когда вы находитесь рядом с этим адресом и не активен когда вы далеко.',

    'PANEL7_Q':'Можно ли не удалять пост, а убрать его на время с показа? (отключить светлячок)?',
    'PANEL7_A':'Да, вы можете включить и выключить каждый опубликованный вами светлячок, когда вы его включаете — информация показывается людям вокруг, когда выключаете — скрывается. Вы сами определяете какие посты и в какой момент времени транслировать, а какие нет и формируете актуальное для вас пространство.',

    'PANEL8_Q':'Можно ли пользоваться Светлячками, без регистрации?',
    'PANEL8_A':'Да, даже без регистрации вы можете отслеживать посты, которые находятся рядом с вами.',

    'PANEL9_Q':'Сколько постов я могу создать?',
    'PANEL9_A':'По количеству постов ограничений нет.',

    'PANEL10_Q':'Надо ли самому удалять/выключать мои объявления, которые уже не актуальны, или это происходит автоматически?',
    'PANEL10_A':'При создании поста вы можете указать срок, на который хотите разместить свое объявление, и по истечении указанного срока объявление станет неактивным (выключится, и его перестанут видеть пользователи). Также в любой момент вы можете включать и выключать ваше объявление самостоятельно.',

    'PANEL11_Q':'Могу ли я скрыть свой профиль при создании поста?',
    'PANEL11_A':'Да, вы можете разместить объявление как анонимный пользователь. Тогда ваша личная информация и информация о других размещенных постах будет скрыта.',

    'PANEL12_Q':'Можно ли, создавая пост на Светлячках, сразу поделиться им в соц. сетях?',
    'PANEL12_A':'Да, у каждого поста есть кнопка поделиться.'
  }
};

T9n.map('ru', ru);
bz.help.makeNamespace('bz.language.i18n.ru', ru);